tests/result_artillery.txt
Phase started: unnamed (index: 0, duration: 1s) 18:02:06(-0500)

Phase completed: unnamed (index: 0, duration: 1s) 18:02:07(-0500)

--------------------------------------
Metrics for period to: 18:02:10(-0500) (width: 3.749s)
--------------------------------------

http.codes.200: ................................................................ 50
http.codes.302: ................................................................ 55
http.request_rate: ............................................................. 41/sec
http.requests: ................................................................. 155
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 1922
  median: ...................................................................... 10.9
  p95: ......................................................................... 34.1
  p99: ......................................................................... 1620
http.responses: ................................................................ 105
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


--------------------------------------
Metrics for period to: 18:02:20(-0500) (width: 9.548s)
--------------------------------------

http.codes.200: ................................................................ 185
http.codes.302: ................................................................ 203
http.request_rate: ............................................................. 42/sec
http.requests: ................................................................. 401
http.response_time:
  min: ......................................................................... 225
  max: ......................................................................... 1424
  median: ...................................................................... 671.9
  p95: ......................................................................... 1353.1
  p99: ......................................................................... 1408.4
http.responses: ................................................................ 388


--------------------------------------
Metrics for period to: 18:02:30(-0500) (width: 9.631s)
--------------------------------------

http.codes.200: ................................................................ 255
http.codes.302: ................................................................ 261
http.request_rate: ............................................................. 54/sec
http.requests: ................................................................. 521
http.response_time:
  min: ......................................................................... 65
  max: ......................................................................... 1032
  median: ...................................................................... 347.3
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1022.7
http.responses: ................................................................ 516


--------------------------------------
Metrics for period to: 18:02:40(-0500) (width: 9.157s)
--------------------------------------

http.codes.200: ................................................................ 253
http.codes.302: ................................................................ 252
http.request_rate: ............................................................. 55/sec
http.requests: ................................................................. 501
http.response_time:
  min: ......................................................................... 65
  max: ......................................................................... 1016
  median: ...................................................................... 125.2
  p95: ......................................................................... 982.6
  p99: ......................................................................... 1002.4
http.responses: ................................................................ 505


--------------------------------------
Metrics for period to: 18:02:50(-0500) (width: 9.265s)
--------------------------------------

http.codes.200: ................................................................ 257
http.codes.302: ................................................................ 229
http.request_rate: ............................................................. 46/sec
http.requests: ................................................................. 422
http.response_time:
  min: ......................................................................... 61
  max: ......................................................................... 1002
  median: ...................................................................... 125.2
  p95: ......................................................................... 982.6
  p99: ......................................................................... 1002.4
http.responses: ................................................................ 486
vusers.completed: .............................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 40153.1
  max: ......................................................................... 43410.5
  median: ...................................................................... 42205.5
  p95: ......................................................................... 43058.1
  p99: ......................................................................... 43058.1


All VUs finished. Total time: 46 seconds

--------------------------------
Summary report @ 18:02:50(-0500)
--------------------------------

http.codes.200: ................................................................ 1000
http.codes.302: ................................................................ 1000
http.request_rate: ............................................................. 48/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 1922
  median: ...................................................................... 295.9
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1353.1
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 40153.1
  max: ......................................................................... 43410.5
  median: ...................................................................... 42205.5
  p95: ......................................................................... 43058.1
  p99: ......................................................................... 43058.1